cf_billing/InformationRegisters/энргСтатусСогласованияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтатусСогласованияСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСтатусыСогласованияСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСобытие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтатусСогласованияСобытий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

#Область РегистрацияДанных

// Процедура - Зарегистрировать статус передача на согласование
//
// Параметры:
//  Период			 - Дата - Период.
//  ДанныеЗаполнения - Структура - Данные заполнения. 
//
Процедура ЗарегистрироватьСтатусПередачаНаСогласование(Период, ДанныеЗаполнения) Экспорт 
	ЗарегистрироватьДанныеПоУмолчанию(Период, ДанныеЗаполнения);
КонецПроцедуры

// Процедура - Зарегистрировать статус вернуть на доработку
//
// Параметры:
//  Период			 - Дата - Период.
//  ДанныеЗаполнения - Структура - Данные заполнения. 
//
Процедура ЗарегистрироватьСтатусВернутьНаДоработку(Период, ДанныеЗаполнения) Экспорт 
	ЗарегистрироватьДанныеПоУмолчанию(Период, ДанныеЗаполнения);
КонецПроцедуры

// Процедура - Зарегистрировать статус согласовано
//
// Параметры:
//  Период			 - Дата - Период.
//  ДанныеЗаполнения - Структура - Данные заполнения. 
//
Процедура ЗарегистрироватьСтатусСогласовано(Период, ДанныеЗаполнения) Экспорт 
	ЗарегистрироватьДанныеПоУмолчанию(Период, ДанныеЗаполнения);
КонецПроцедуры
	
#КонецОбласти

#Область РеализацияИнтерфейса

#Если Сервер Тогда
	
// Процедура - Статус согласования событий
//
// Параметры:
//  Схема				 - СхемаЗапроса - Схема запроса. 
//  ПараметрыОтбора		 - Структура 	- Параметры отбора.  
//  ТаблицаДляПомещения	 - Строка 		- Имя таблицы помещения. 
//
Процедура СтатусСогласованияСобытий(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСтатусСогласованияСобытий());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 			= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;
	
	ПараметрПериод 						= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация,Район,ДокРегистратор";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1], ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыОтбора") Тогда
		ДоступныеПараметры = "Статус";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор, "энргСтатусСогласованияСобытийСрезПоследних", ПараметрыОтбора.ПараметрыОтбора, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область ПолучениеДанных

// Функция - Получить статус документа событие
//
// Параметры:
//  Период			 - Дата - Период.
//  Организация		 - СправочникСсылка.Организации - Организация. 
//  Район			 - СправочникСсылка.энргЗоныОтвественности - Район. 
//  ДокРегистратор	 - ДокументСсылка.энргСобытие - Событие.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.энргСтатусыСогласованияСобытий - Статус документа события.
//
Функция ПолучитьСтатусДокументаСобытие(Период, Организация, Район, ДокРегистратор) Экспорт 
	Результат = Перечисления.энргСтатусыСогласованияСобытий.ПустаяСсылка();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтатусСогласованияСобытийСрезПоследних.ДокРегистратор КАК ДокРегистратор,
		|	энргСтатусСогласованияСобытийСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.энргСтатусСогласованияСобытий.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ДокРегистратор = &ДокРегистратор) КАК энргСтатусСогласованияСобытийСрезПоследних";
	
	Запрос.УстановитьПараметр("Период"			, Период);	
	Запрос.УстановитьПараметр("Организация"		, Организация);	
	Запрос.УстановитьПараметр("Район"			, Район);
	Запрос.УстановитьПараметр("ДокРегистратор"	, ДокРегистратор);
	
	РезультатЗапроса 	= Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка 			= РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.Статус;
	
	Возврат Результат;	
КонецФункции
	
#КонецОбласти

#Область ВспомогательныеМетоды

// Функция - Получить описание объекта
// 
// Возвращаемое значение:
//  Структура - возвращает описание свойств регистра. 
//
Функция ПолучитьОписаниеОбъекта() Экспорт
	Возврат энргОбщегоНазначения.ПолучитьОписаниеСвойствРегистра(Метаданные.РегистрыСведений.энргСтатусСогласованияСобытий);
КонецФункции

#КонецОбласти 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаСтатусСогласованияСобытий()
	
	Текст  		=
	"ВЫБРАТЬ
	|	энргСтатусСогласованияСобытийСрезПоследних.Период КАК Период,
	|	энргСтатусСогласованияСобытийСрезПоследних.Организация КАК Организация,
	|	энргСтатусСогласованияСобытийСрезПоследних.Район КАК Район,
	|	энргСтатусСогласованияСобытийСрезПоследних.ДокРегистратор КАК ДокРегистратор,
	|	энргСтатусСогласованияСобытийСрезПоследних.Исполнитель КАК Исполнитель,
	|	энргСтатусСогласованияСобытийСрезПоследних.Статус КАК Статус,
	|	энргСтатусСогласованияСобытийСрезПоследних.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.энргСтатусСогласованияСобытий.СрезПоследних КАК энргСтатусСогласованияСобытийСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

Процедура ЗарегистрироватьДанныеПоУмолчанию(Период, ДанныеЗаполнения)
	
	МенеджерЗаписи 			= СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период 	= Период;
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаполнения);
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
